{
  "plan": "# Implementation Plan: Wire Review Locally Functionality\n\n## Overview\n\nWire the \"Review Locally\" flow in the Human Review phase so that when the user clicks it, the app opens an IDE (Cursor first, then VS Code if Cursor is not available) at the task's worktree path, with optional staging/git status context in the IDE. Support Cursor, VS Code, and \"Open in file explorer\" from the same flow. Auto-detect which IDEs are installed, show icons for found IDEs, default to the first available, and allow the user to choose another from the list. Use the project directory from the project store (header) to resolve the worktree path as `projectRoot + \".code-auto/worktrees/{taskId}\"`. Show a success toast with the worktree path after opening. No new E2E tests.\n\n## Technical Approach\n\n- **Worktree path**: Always derive client-side as `projectPath + \"/.code-auto/worktrees/\" + task.id`, where `projectPath` comes from `useProjectStore().projectPath`. No API call needed for path resolution.\n- **Where logic runs**: Open-IDE and open-folder actions run in the **Electron main process** (shell/spawn), since the renderer cannot open local apps or the system file manager. The Human Review modal (renderer) will call new IPC APIs exposed via preload.\n- **IDE detection**: In main process, detect Cursor (e.g. `which cursor`, or on macOS `/Applications/Cursor.app`), then VS Code (`which code` or `/Applications/Visual Studio Code.app`). Return a list of available editors with ids (`cursor` | `vscode`), labels, and a simple icon identifier so the UI can show icons.\n- **Opening IDE**: Use `child_process.spawn` with the appropriate CLI (`cursor <path>`, `code <path>`) or on macOS `open -a \"Cursor\" <path>` / `open -a \"Visual Studio Code\" <path>` so the IDE opens at the worktree folder (user can then run git status/stage in the IDE). Precedence: Cursor, then VS Code.\n- **Open in file explorer**: Use Electron `shell.openPath(dir)` or Node `require('child_process').exec` with platform-specific command (macOS: `open <path>`, Windows: `explorer <path>`, Linux: `xdg-open <path>`).\n- **Web fallback**: When `window.electron` is undefined (e.g. running in browser), disable or hide \"Review Locally\" and \"Open in VS Code\" / \"Open in File Explorer\", or show a short message: \"Use the desktop app to open in IDE or file explorer.\"\n\n## Implementation Steps\n\n1. **Electron: Editor detection**  \n   In `electron/main.js`, add logic to detect available editors (Cursor, VS Code). Check for CLI in PATH (`which cursor`, `which code`) and on darwin for `.app` paths. Return an array of `{ id: 'cursor'|'vscode', label: string, available: boolean }`. Expose via IPC handler `review-locally:get-editors` (or `get-available-editors`).\n\n2. **Electron: Open editor at path**  \n   Add IPC handler `review-locally:open-editor` that accepts `{ worktreePath: string, editorId: 'cursor'|'vscode' }`. Validate that `worktreePath` is under a safe base (e.g. project path or user home) and that the path exists (fs.existsSync). Spawn the appropriate command (e.g. `cursor <path>` or `code <path>`; on macOS can use `open -a \"Cursor\" <path>`). Use `spawn(..., { detached: true, stdio: 'ignore' })` so the app does not wait. Return `{ success: boolean, error?: string }`.\n\n3. **Electron: Open folder in file manager**  \n   Add IPC handler `review-locally:open-folder` that accepts `{ worktreePath: string }`. Validate path exists and is a directory. Use `shell.openPath(worktreePath)` or platform-specific open command. Return `{ success: boolean, error?: string }`.\n\n4. **Preload and types**  \n   In `electron/preload.js`, expose: `getAvailableEditors()`, `openEditorAtPath(worktreePath, editorId)`, `openFolder(worktreePath)`. In `src/types/electron.d.ts`, extend `ElectronAPI` with these methods and type the editor list (`{ id: string, label: string }[]`).\n\n5. **HumanReviewModal: Worktree path and Electron check**  \n   In `HumanReviewModal`, read `projectPath` from `useProjectStore()`. Compute `worktreePath = projectPath ? path.join(projectPath, '.code-auto', 'worktrees', task.id) : null`. If no `projectPath`, disable \"Review Locally\" and \"Open in File Explorer\" and show a short message. Detect Electron with `typeof window !== 'undefined' && window.electron`.\n\n6. **HumanReviewModal: Unify \"Review Locally\" with IDE picker**  \n   Replace the current separate \"Review Changes Locally\" button and the separate \"VS Code\" card with a single \"Review Locally\" section that: (a) On mount or when modal opens, if Electron, call `getAvailableEditors()` and store result in state. (b) Show icons/labels for each available editor (Cursor, VS Code). Default the primary action to the first available (Cursor preferred). (c) Primary button: \"Open in [Cursor|VS Code]\" (or \"Review Locally\" that uses default). Optional: dropdown or secondary buttons to \"Open in VS Code\" / \"Open in Cursor\" when both are available. (d) On click, call `openEditorAtPath(worktreePath, selectedEditorId)`. On success, show toast with message like \"Opened at <worktreePath>\". On failure (e.g. path missing, spawn error), show toast error.\n\n7. **HumanReviewModal: Wire \"Open in File Explorer\"**  \n   Keep the File Explorer card. On button click, call `openFolder(worktreePath)`. Same validation (projectPath and worktree path). Toast success with path on success.\n\n8. **Edge cases**  \n   - If worktree path does not exist, show toast error (e.g. \"Worktree not found at ...\") and do not call open. Optionally show the path in the message.  \n   - If no editor is available, show \"No IDE found\" and disable the primary Review Locally button or show a message.  \n   - When not in Electron, do not call IPC; show disabled state or \"Use desktop app\" message for Review Locally and Open in File Explorer.\n\n## Files to Modify\n\n| File | Action |\n|------|--------|\n| `electron/main.js` | Add editor detection helpers; add IPC handlers `review-locally:get-editors`, `review-locally:open-editor`, `review-locally:open-folder`. |\n| `electron/preload.js` | Expose `getAvailableEditors`, `openEditorAtPath`, `openFolder` via `contextBridge`. |\n| `src/types/electron.d.ts` | Extend `ElectronAPI` with the new methods and editor type. |\n| `src/components/tasks/human-review-modal.tsx` | Use project store for `projectPath`; compute `worktreePath`; call Electron APIs for Review Locally (with IDE list and default) and Open in File Explorer; show toasts; handle non-Electron and missing path/editors. |\n\n## Files to Create\n\n- None. All changes are in existing files.\n\n## Testing Strategy\n\n- **Manual verification (Electron)**: Open app in Electron, set project path, have a task in human_review phase with an existing worktree. Click \"Review Locally\" and confirm Cursor or VS Code opens at the worktree folder. If both are installed, confirm the default and that the user can choose the other. Click \"Open in File Explorer\" and confirm the system file manager opens at the worktree. Confirm toasts show the worktree path on success.  \n- **Manual verification (no project path)**: With no project selected, confirm Review Locally and Open in File Explorer are disabled or show appropriate message.  \n- **Manual verification (web)**: Run in browser (no Electron); confirm Review Locally / Open in File Explorer are disabled or show \"Use desktop app\".  \n- **No new E2E tests** per user preference.\n\n## Potential Issues\n\n- **Cursor CLI name**: Cursor may expose `cursor` in PATH when installed; if not, macOS can use `open -a \"Cursor\" <path>`. Prefer CLI when available so behavior is consistent across platforms.  \n- **Path validation**: Ensure `worktreePath` is absolute and does not escape project root (e.g. reject `..` segments or ensure path starts with project path) to avoid opening arbitrary directories.  \n- **Path existence**: At human_review phase the worktree should exist; if it was deleted externally, failing with a clear toast is acceptable.  \n- **Windows/Linux**: Test `code` and `cursor` CLI availability; fallback to platform-specific app launch if needed.  \n- **SSR**: Modal is client-only; `useProjectStore` and `window.electron` are safe after mount.\n\n## Success Criteria\n\n- User in Human Review phase can click \"Review Locally\" and have Cursor (or VS Code if Cursor unavailable) open at the task worktree path.  \n- Available IDEs are detected and shown (icons/labels); user can choose Cursor or VS Code when both are available.  \n- \"Open in File Explorer\" opens the system file manager at the same worktree path.  \n- Success toast shows the worktree path after opening IDE or folder.  \n- Worktree path is always derived from project store project root + `.code-auto/worktrees/{taskId}`.  \n- When project path is missing or app is not running in Electron, the actions are disabled or show a clear message.  \n- No new E2E tests added.\n"
}
